; domain
(define (domain joint_bar)
(:requirements :strips :equality :typing :adl :conditional-effects)

(:types link angle)

(:predicates
	(AngleOrd ?a - angle ?a1 - angle)
	(HasAngle ?l - angle ?j - link)
	(Affected ?l1 - link ?l2 - link)
    (IsChildOf ?l1 - link ?l2 - link)
)

(:action increase_angle
:parameters (?child_link - link ?a1 ?a2 - angle)
:precondition (and 
	(HasAngle ?a1 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a1 ?child_link)) 
	    (HasAngle ?a2 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a3 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a3 ?ls))
			        (HasAngle ?a4 ?ls)
		        )
		    )
	    )
    )
)

(:action decrease_angle
:parameters (?child_link - link ?a2 ?a1 - angle)
:precondition (and 
	(HasAngle ?a2 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a2 ?child_link)) 
	    (HasAngle ?a1 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a4 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a4 ?ls))
			        (HasAngle ?a3 ?ls)
		        )
		    )
	    )
    )
)
)

; problem
(define (problem joint_bar_9)
(:domain joint_bar)
(:objects
    link1 link2 link3 - link
    angle0 angle40 angle80 angle120 angle160 angle200 angle240 angle280 angle320 - angle)
(:init
    (AngleOrd angle0 angle40)
    (AngleOrd angle40 angle80)
    (AngleOrd angle80 angle120)
    (AngleOrd angle120 angle160)
    (AngleOrd angle160 angle200)
    (AngleOrd angle200 angle240)
    (AngleOrd angle240 angle280)
    (AngleOrd angle280 angle320)
    (AngleOrd angle320 angle0)

    (IsChildOf link2 link1)
    (IsChildOf link3 link2)

    (Affected link2 link1)
    (Affected link3 link1)
    (Affected link3 link2)

    (HasAngle angle240 link1)
    (HasAngle angle120 link2)
    (HasAngle angle320 link3)
)
(:goal
(and
    (HasAngle angle280 link1)
    (HasAngle angle0 link2)
    (HasAngle angle240 link3)
    )
)
)

; plan
1. (increase_angle link1 angle240 angle280)
   deleted: (hasangle angle240 link1) (hasangle angle120 link2) (hasangle angle320 link3)
   added: (hasangle angle280 link1) (hasangle angle160 link2) (hasangle angle0 link3)
   goals met: 1 of 3
2. (decrease_angle link2 angle160 angle120)
   deleted: (hasangle angle160 link2) (hasangle angle0 link3)
   added: (hasangle angle120 link2) (hasangle angle320 link3)
   goals met: 1 of 3
3. (decrease_angle link2 angle120 angle80)
   deleted: (hasangle angle120 link2) (hasangle angle320 link3)
   added: (hasangle angle80 link2) (hasangle angle280 link3)
   goals met: 1 of 3
4. (decrease_angle link2 angle80 angle40)
   deleted: (hasangle angle80 link2) (hasangle angle280 link3)
   added: (hasangle angle40 link2) (hasangle angle240 link3)
   goals met: 2 of 3
5. (decrease_angle link2 angle40 angle0)
   deleted: (hasangle angle40 link2) (hasangle angle240 link3)
   added: (hasangle angle0 link2) (hasangle angle200 link3)
   goals met: 2 of 3
6. (increase_angle link3 angle200 angle240)
   deleted: (hasangle angle200 link3)
   added: (hasangle angle240 link3)
   goals met: 3 of 3
